Revit 2027 API
NumberingSchema.HasRoomRelatedParameters Property
 Returns true if in the partitioning, matching or formatting there are parameters that require room associations.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool HasRoomRelatedParameters { get; }
Public ReadOnly Property HasRoomRelatedParameters As Boolean
	Get
public:
property bool HasRoomRelatedParameters {
	bool get ();
}
member HasRoomRelatedParameters : bool with get
Property Value
Boolean
See Also
Reference
NumberingSchema Class
Autodesk.Revit.DB Namespace